Revit 2026 API

# FillPatternSetFillGrids Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFillGrids(
	IList<FillGrid> fillGrids
)
```
```vb
Public Sub SetFillGrids (
	fillGrids As IList(Of FillGrid)
)
```
```cpp
public:
void SetFillGrids(
	IList<FillGrid^>^ fillGrids
)
```
```fsharp
member SetFillGrids :
        fillGrids : IList<FillGrid> -> unit
```

#### Parameters

fillGrids IListFillGrid

#### Reference

FillPattern Class

Autodesk.Revit.DB Namespace